Examples/FSI_Turek/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |

# Author1: Nithin Adidela, IIT Goa
# email: nithin.adiela.16003@iitgoa.ac.in

# Author2: Revanth Sharma Kollegala, IIT Goa
# email: revanth.sharma.16003@iitgoa.ac.in

# Author3: Y Sudhakar, IIT Goa
# email: sudhakar@iitgoa.ac.in

# Inspired by the contribution by Derek Risseeuw (TU Delft).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    cylinder
    {
        type            noSlip;
    }    

    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    top
    {
        type            noSlip;
    }

    bottom
    {
        type            noSlip;
    }

    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            parabolicInlet;

        code
        #{
            const scalar Umean = 1.0;
            const scalar H = 0.41;
            const scalar t = this->db().time().value();

            scalar ramp = 1.0;
            if (t <= 2.0)
            {
                ramp = 0.5*(1.0 - cos(0.5*constant::mathematical::pi*t));
            }

            forAll(*this, faceI)
            {
                const scalar y = patch().Cf()[faceI].y();

                const scalar Ux =
                    ramp * 6.0*Umean*y*(H-y)/(H*H);

                operator[](faceI) = vector(Ux, 0.0, 0.0);
            }
        #};
    }

    outlet
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
