Examples/FSI_Turek/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    flap
    {
        type            fixedValue;
        value           nonuniform List<vector> 
182
(
(2.1983253436e-09 9.2810709569e-09 0)
(2.1983253436e-09 9.2810709569e-09 0)
(2.22623882777e-09 1.08450312959e-08 0)
(2.22623882777e-09 1.08450312959e-08 0)
(1.8797966073e-09 1.33433724156e-08 0)
(1.8797966073e-09 1.33433724156e-08 0)
(1.24521507232e-09 1.51640670129e-08 0)
(1.24521507232e-09 1.51640670129e-08 0)
...
)
;
    }
    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
